//
// Created by dingrui on 2023/1/11.
//

#include "delay.h"

// 时延 20ms为步进值
// STC89C52RC晶振=11.0592MHz
// 时钟周期=1/11059200(s)
// KST51架构下机器周期=12个时钟周期=12/11059200(s)
// 假定一个延时20ms为单位
// 就是求n个机器周期总时长是0.02s n=0.02/(12/11.0592)=0.02*11059200/12=18432
// 16位定时器的溢出值是65536(65535+1后溢出)
// 给定时器设置一个初值 每次经过一个机器周期就自增1 经过18432个机器周期后达到65536溢出 通过检测TF0的值判定定时器值是否溢出 溢出了说明经过了一个20ms时常
// 用户需要多久的定时操作就给定对应的20ms的倍数 比如要实现sleep(1s)就传实参50
void delay_20ms(unsigned char target)
{
    if (target == 0) return; // 不需要延时
    unsigned char cnt = 0; // 计数变量记录T0溢出次数
    TMOD = 0x01; // T0为模式1
    TH0 = 0xBB; // T0初值0xBB00
    TL0 = 0x00;
    TR0 = 1; // 启动T0
    for (;;)
    {
        if (TF0 == 1)
        {
            // 检测T0到溢出
            TF0 = 0; // T0溢出后清0中断标志
            TH0 = 0xBB; // 重新赋值
            TL0 = 0x00;
            cnt++;
            if (cnt >= target) return;
        }
    }
}
