//
// Created by dingrui on 2023/1/14.
//

#pragma once

/**
 * @brief 从上至下方向按行滚动点亮led
 *        led点阵阴极连接P0端口 全部输出低电平
 *        从上至下为[A1...A8]分别连接着74HC595芯片的[DPh...DPa]
 *                   DPh DPg DPf DPe DPd DPc DPb DPa    芯片SER输入
 *        第1行点亮    1   0   0   0   0   0   0   0        0x80
 *        第2行点亮    0   1   0   0   0   0   0   0        0x40
 *        第3行点亮    0   0   1   0   0   0   0   0        0x20
 *        第4行点亮    0   0   0   1   0   0   0   0        0x10
 *        第5行点亮    0   0   0   0   1   0   0   0        0x08
 *        第6行点亮    0   0   0   0   0   1   0   0        0x04
 *        第7行点亮    0   0   0   0   0   0   1   0        0x02
 *        第8行点亮    0   0   0   0   0   0   0   1        0x01
 */
void scroll_led_matrix_up_2_down();

/**
 * @brief 点亮点阵左上角 第一行第一列的灯
 *        P0端口输出低电平
 *        P0.7 P0.6 P0.5 P0.4 P0.3 P0.2 P0.1 P0.0
 *         0     1    1    1    1    1    1    1
 *        即P0端口的输出为0x7f
 *
 *        DP引脚输出为高电平 74HC595并联输出为高电平
 *        DPh DPg DPf DPe DPd DPc DPb DPa
 *         1   0   0   0   0   0   0   0
 *        即595芯片并联输出为0x80
 *        也就是给595芯片SER的输入为0x80
 */
void on_left_top();

/**
 * @brief 在8*8的led点阵上显示0
 *        0 0 0 0 0 0 0 0
 *        0 0 x x x x 0 0
 *        0 x 0 0 0 0 x 0
 *        0 x 0 0 0 0 x 0
 *        0 x 0 0 0 0 x 0
 *        0 x 0 0 0 0 x 0
 *        0 0 x x x x 0 0
 *        0 0 0 0 0 0 0 0
 *        x标识的位置就是要点亮的led
 *        按照列进行扫描 8列的总延时时间不超过余晖
 *
 *        第几列 P0端口的输出 595芯片的输出
 *          1   1111 1111    0000 0000
 *          2   1011 1111    0011 1100
 *          3   1101 1111    0100 0010
 *          4   1110 1111    0100 0010
 *          5   1111 0111    0100 0010
 *          6   1111 1011    0100 0010
 *          7   1111 1101    0011 1100
 *          8   1111 1111    0000 0000
 */
void display_img_0();